#include <stdio.h>
  int main(){
   int l,n,a,b,i,j,k,c;
   int dp[101][4][4]; /*dp[a][b][c]とはa日間のパスタの作り方のうちa-1日目がbで、a日目はｃである場合の数。*/
   int x[101];
   scanf("%d %d",&n,&k);
   x[1] = 0;
   for(i=2;i<=n;i++){
	   for(j=1;j<4;j++){
		   for(l=1;l<4;l++){
			   dp[i][j][l] = 0;
			   x[i] = 0;
		   }
	   }
   }
   
   for(i=0;i<k;i++){
	   scanf("%d %d",&a,&b);
	     x[a] = b;
   }
   for(i=1;i<4;i++){
	   for(j=1;j<4;j++){
		   dp[2][i][j] = 1;
	   }
   }
   if(x[1] != 0){
	   for(i=1;i<4;i++){
		   if(i != x[1]){
		   dp[2][i][1]=0;
		   dp[2][i][2]=0;
		   dp[2][i][3]=0;
		   }
	   }
   }
   if(x[2] != 0){
	   for(i=1;i<4;i++){
		   if(i != x[2]){
		   dp[2][1][i]=0;
		   dp[2][2][i]=0;
		   dp[2][3][i]=0;
		   dp[3][i][1]=0;
		   dp[3][i][2]=0;
		   dp[3][i][3]=0;
		   }
	   }
   }
   for(i=2;i<n;i++){
	   dp[i+1][1][1]=(dp[i][2][1]+dp[i][3][1])%10000;
	   dp[i+1][1][2]=(dp[i][1][1]+dp[i][2][1]+dp[i][3][1])%10000;
	   dp[i+1][1][3]=(dp[i][1][1]+dp[i][2][1]+dp[i][3][1])%10000;
	   dp[i+1][2][1]=(dp[i][1][2]+dp[i][2][2]+dp[i][3][2])%10000;
	   dp[i+1][2][2]=(dp[i][1][2]+dp[i][3][2])%10000;
	   dp[i+1][2][3]=(dp[i][1][2]+dp[i][2][2]+dp[i][3][2])%10000;
	   dp[i+1][3][1]=(dp[i][1][3]+dp[i][2][3]+dp[i][3][3])%10000;
	   dp[i+1][3][2]=(dp[i][1][3]+dp[i][2][3]+dp[i][3][3])%10000;
	   dp[i+1][3][3]=(dp[i][1][3]+dp[i][2][3]);
	   
	   if(x[i+1] != 0){
	   for(j=1;j<4;j++){
		   if(j != x[i+1]){
		   dp[i+1][1][j]=0;
		   dp[i+1][2][j]=0;
		   dp[i+1][3][j]=0;
		   dp[i+2][j][1]=0;
		   dp[i+2][j][2]=0;
		   dp[i+2][j][3]=0;
		   } 
	   }
   }
	   
   }
   int sum = 0;
	for(i=1;i<4;i++){
		for(j=1;j<4;j++){
			sum += dp[n][i][j];
		}
	}
	printf("%d\n",sum%10000);
	scanf("%d",&i);
	return 0;
  }